
[
  "In the movie Interstellar, 1 hour on Miller's planet equals 7 years on Earth due to time dilation near the black hole Gargantua.",
  "The theory of relativity predicts that time passes slower in stronger gravitational fields.",
  "A black hole's event horizon is a point of no return - not even light can escape once it crosses this boundary.",
  "The Marvel Cinematic Universe exists across multiple timelines after the events of Avengers: Endgame.",
  "Stephen Hawking's 'A Brief History of Time' explains that the universe has no beginning in imaginary time.",
  "The speed of light in a vacuum is 299,792,458 meters per second.",
  "In Marvel's Loki series, the Time Variance Authority monitors and preserves the 'sacred timeline'.",
  "Some calculations suggest our universe is about 13.8 billion years old.",
  "The concept of a 'tesseract' represents a four-dimensional cube.",
  "Time dilation means astronauts on the International Space Station age slightly slower than people on Earth.",
  "Clocks on GPS satellites are adjusted to account for time dilation effects from general relativity.",
  "The 'quantum realm' mentioned in Ant-Man is inspired by real quantum physics concepts.",
  "Earth completes one rotation on its axis every 23 hours, 56 minutes, and 4 seconds.",
  "The 'tesseract' appears in both Marvel (containing the Space Stone) and Interstellar (as a multidimensional space).",
  "Light from some stars we see at night left those stars millions of years ago.",
  "A wormhole, like the one in Interstellar, theoretically connects two separate points in spacetime.",
  "In the comic book multiverse, Marvel's character Kang the Conqueror manipulates timelines for power.",
  "The 'twin paradox' describes how a twin traveling at near light-speed would age slower than their Earth-bound sibling.",
  "Physicist Kip Thorne was a scientific advisor for Interstellar, ensuring scientific accuracy where possible.",
  "The term 'spacetime' refers to the fusion of three-dimensional space and time into a four-dimensional continuum.",
  "The fifth dimension in Interstellar allows Cooper to interact with the past, but not change it directly.",
  "The 'time stone' in the Marvel universe allows its user to manipulate time, similar to controlling entropy.",
  "Leap years are necessary because Earth's orbit around the Sun takes approximately 365.25 days.",
  "The movie Interstellar depicts a 'closed timelike curve,' a path through spacetime that returns to its starting point.",
  "According to relativity, as an object approaches the speed of light, time for that object slows down compared to a stationary observer.",
  "The movie 'Interstellar' used real equations for the visual effects of the black hole Gargantua.",
  "Some physicists theorize that time itself may have emerged from quantum entanglement.",
  "The butterfly effect suggests that small changes in initial conditions can lead to large differences in later states.",
  "In Marvel's Doctor Strange, the Time Stone is kept in the Eye of Agamotto and can manipulate probabilities and time.",
  "Astronaut Scott Kelly aged slightly less than his identical twin brother Mark during his year in space."
]
